Revit 2027 API
ExternalFileReference.GetReferencingId Method
 Gets the ElementId corresponding to the element which this ExternalFileReference is associated with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetReferencingId()
Public Function GetReferencingId As ElementId
public:
ElementId^ GetReferencingId()
member GetReferencingId : unit -> ElementId
Return Value
ElementId
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace